## Import liabraries

In [10]:
import pandas as pd
import seaborn as sns

## Load titanic Data

In [12]:
df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

## Check Uinque Value

In [13]:
df['survived'].unique()

array([0, 1])

## Check Value Counts

In [14]:
df['survived'].value_counts()

survived
0    549
1    342
Name: count, dtype: int64

## Check Data Information

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

## Check Data Shape

In [16]:
df.shape

(891, 15)

## Check Duplicated

In [17]:
df.duplicated().sum()

np.int64(107)

## Drop Duplicated

In [18]:
df=df.drop_duplicates()
df.duplicated().sum()

np.int64(0)

## check missing Values

In [19]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            106
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           582
embark_town      2
alive            0
alone            0
dtype: int64

## Drop Missing Values

In [20]:
df.dropna(inplace=True)

## Select Specific Columns

In [22]:
df[['pclass']]

     pclass
1         1
3         1
6         1
10        3
11        1
..      ...
871       1
872       1
879       1
887       1
889       1

[181 rows x 1 columns]

## Multiple Columns

In [23]:
df[['who','survived']]

       who  survived
1    woman         1
3    woman         1
6      man         0
10   child         1
11   woman         1
..     ...       ...
871  woman         1
872    man         0
879  woman         1
887  woman         1
889    man         1

[181 rows x 2 columns]

## Rename columns name

In [24]:
df.rename(columns={'sex':'Gender'},inplace=True)

In [25]:
df.head(2)

,survived,pclass,Gender,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False

## All columns name

In [30]:
df.columns

Index(['survived', 'pclass', 'Gender', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

## Pandas Data frame

In [31]:
my_data=pd.DataFrame({'Player':['Shahid Afridi','Umer Akmal','Shoaib Akhter'],
                      'Runs':[35,22,np.nan],
                      'Ballas':[15,12,4]})
my_data

NameError: name 'np' is not defined

##### why this **Error** is comming?  Lets resolve
Because we have to import **np** Liabrary (numpy)

In [32]:
import numpy as np
my_data=pd.DataFrame({'Player':['Shahid Afridi','Umer Akmal','Shoaib Akhter'],
                      'Runs':[35,22,np.nan],
                      'Ballas':[15,12,4]})
my_data

          Player  Runs  Ballas
0  Shahid Afridi  35.0      15
1     Umer Akmal  22.0      12
2  Shoaib Akhter   NaN       4

## Filter Data Frame

In [35]:
df[df['Gender']=='male'] # only male

,survived,pclass,Gender,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
21,1,2,male,34.0,0,0,13.0000,S,Second,man,True,D,Southampton,yes,True
23,1,1,male,28.0,0,0,35.5000,S,First,man,True,A,Southampton,yes,True
27,0,1,male,19.0,3,2,263.0000,S,First,man,True,C,Southampton,no,False
54,0,1,male,65.0,0,1,61.9792,C,First,man,True,B,Cherbourg,no,False

In [36]:
df[df['class'].isin(['First','Third'])]

,survived,pclass,Gender,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

## The End